string1 = """

102953213101794

马浩泷

081200

计算机科学与技术

160.11

全日制


102953213106566

朱俊彬

081200

计算机科学与技术

158.40

全日制


102953213103749

夏青峰

081200

计算机科学与技术

157.76

全日制


102953213110489

冯华兴

081200

计算机科学与技术

152.76

全日制


102953213110838

李海洋

081200

计算机科学与技术

152.58

全日制


102953213112106

张国良

081200

计算机科学与技术

152.45

全日制


102953213103160

张华晨

081200

计算机科学与技术

148.68

全日制


102953213113826

高道强

081200

计算机科学与技术

146.18

全日制


102953213111926

廖克勤

081200

计算机科学与技术

145.91

全日制


102953213103158

吉亮

081200

计算机科学与技术

144.76

全日制


102953213109215

凌儒可

081200

计算机科学与技术

144.57

全日制


102953213109924

徐健聪

081200

计算机科学与技术

143.52

全日制


102953213108035

孟运

081200

计算机科学与技术

143.24

全日制


102953213100585

王晨

081200

计算机科学与技术

142.54

全日制


102953213102801

谢德宇

081200

计算机科学与技术

142.14

全日制


102953213115265

金仕涛

081200

计算机科学与技术

141.54

全日制


102953213106547

罗皝

081200

计算机科学与技术

141.38

全日制


102953213116923

邱灿

081200

计算机科学与技术

141.35

全日制


102953213106533

顾铭贤

081200

计算机科学与技术

140.77

全日制


102953213110161

张京晨

081200

计算机科学与技术

140.52

全日制


102953213110619

曹锐

081200

计算机科学与技术

140.51

全日制


102953213117099

李民志

081200

计算机科学与技术

140.14

全日制


102953213111549

邢宇星

081200

计算机科学与技术

140.09

全日制


102953213108036

孟志明

081200

计算机科学与技术

139.17

全日制


102953213110897

高鸿勋

081200

计算机科学与技术

138.50

全日制


102953213109732

陈涛

081200

计算机科学与技术

138.39

全日制


102953213102798

宋泽

081200

计算机科学与技术

137.15

全日制


102953213101644

丛瑞

081200

计算机科学与技术

136.86

全日制


102953213109669

谢威

081200

计算机科学与技术

136.35

全日制


102953213114822

张子毅

081200

计算机科学与技术

136.16

全日制


102953213116090

何哲

081200

计算机科学与技术

136.11

全日制


102953213114330

刘浩

081200

计算机科学与技术

136.03

全日制


102953213106562

张以沫

081200

计算机科学与技术

136.02

全日制


102953213100370

白昕炜

081200

计算机科学与技术

135.21

全日制


102953213106546

鲁天硕

081200

计算机科学与技术

135.21

全日制


102953213106563

张子尧

081200

计算机科学与技术

134.57

全日制
"""


string2= """

马浩泷

102953213101794

计算机科学与技术

63

80

133

111

387


夏青峰

102953213103749

计算机科学与技术

65

77

107

131

380


张国良

102953213112106

计算机科学与技术

64

50

127

136

377


高道强

102953213113826

计算机科学与技术

69

73

104

122

368


廖克勤

102953213111926

计算机科学与技术

66

60

131

107

364


朱俊彬

102953213106566

计算机科学与技术

65

64

92

142

363


邢宇星

102953213111549

计算机科学与技术

58

54

128

122

362


陈涛

102953213109732

计算机科学与技术

54

61

125

116

356


吉亮

102953213103158

计算机科学与技术

63

72

102

115

352


张子尧

102953213106563

计算机科学与技术

58

56

101

135

350


徐健聪

102953213109924

计算机科学与技术

62

75

101

112

350


孟运

102953213108035

计算机科学与技术

74

77

98

100

349


李民志

102953213117099

计算机科学与技术

58

65

102

124

349


孟志明

102953213108036

计算机科学与技术

66

68

95

118

347


冯华兴

102953213110489

计算机科学与技术

67

57

108

111

343


李金龙

102953213115396

计算机科学与技术

63

81

91

108

343


邱灿

102953213116923

计算机科学与技术

61

60

92

126

339


张子毅

102953213114822

计算机科学与技术

57

63

95

118

333


谢德宇

102953213102801

计算机科学与技术

60

56

116

99

331


张华晨

102953213103160

计算机科学与技术

63

60

89

118

330


张京晨

102953213110161

计算机科学与技术

60

66

96

108

330


李海洋

102953213110838

计算机科学与技术

59

60

106

105

330


王晨

102953213100585

计算机科学与技术

49

72

92

116

329


金仕涛

102953213115265

计算机科学与技术

61

72

85

111

329


白昕炜

102953213100370

计算机科学与技术

51

47

113

116

327


何哲

102953213116090

计算机科学与技术

60

48

96

122

326


凌儒可

102953213109215

计算机科学与技术

63

65

81

116

325


白枫林

102953213114263

计算机科学与技术

70

65

74

114

323


张凯

102953213109219

计算机科学与技术

65

59

98

100

322


韩佳诺

102953213108307

计算机科学与技术

70

53

100

98

321


高鸿勋

102953213110897

计算机科学与技术

51

67

107

95

320


刘浩

102953213114330

计算机科学与技术

58

56

100

105

319


丛瑞

102953213101644

计算机科学与技术

59

70

86

103

318


张以沫

102953213106562

计算机科学与技术

68

67

85

98

318


辛洪国

102953213112224

计算机科学与技术

66

45

101

106

318


宋京昊

102953213106550

计算机科学与技术

69

72

68

107

316


谢威

102953213109669

计算机科学与技术

65

55

112

84

316


薄惠宇

102953213113175

计算机科学与技术

65

60

77

112

314


顾铭贤

102953213106533

计算机科学与技术

68

49

102

94

313


鲁天硕

102953213106546

计算机科学与技术

62

52

79

120

313


袁亚辉

102953213100381

计算机科学与技术

63

43

110

96

312


许梓浩

102953213102803

计算机科学与技术

56

68

95

93

312


梁其汇阳

102953213113491

计算机科学与技术

67

54

71

120

312


宋泽

102953213102798

计算机科学与技术

65

69

81

94

309


罗皝

102953213106547

计算机科学与技术

62

69

78

100

309


曹锐

102953213110619

计算机科学与技术

68

51

77

113

309


陈昊

102953213102795

计算机科学与技术

61

61

90

96

308


"""
import csv

def judge(o):
    if o[0]=="":
        o = o[1:]
    return o

string1_li = [judge(i.split("\n\n")) for i in string1.split("\n\n\n")]
string2_li = [judge(i.split("\n\n")) for i in string2.split("\n\n\n")]

new1 = []
new2 = []

for i in string1_li:
    # print(i)
    if len(i)<4:
        continue

    # print(i)

    new1.append([i[0],i[1],int(i[2]),i[3], float(i[4])])
for i in string2_li:
    if len(i)<4:
        continue
    new2.append([i[0],int(i[1]),i[2],int(i[3]),int(i[4]) ,int(i[5]),int(i[6]),int(i[7])])
print(new1)
print(new2)
w = csv.writer(open("scores.csv","w",encoding="utf-8",newline=""))

w.writerows(new1)
w.writerows(new2)
